{"transcript":"<p>Welcome to design systems engineer. I really appreciate you taking the time to participate in this course.</p>\n<p>I wanted to take a second to show you around and talk about how you can make the most of the content.</p>\n<p>Before we jump in, there's a high likelihood that the website I'm showing you now looks different than the website you're seeing. That's because the site for this course uses the design system we'll be building together. It is a living system that will update as we work on it.</p>\n<p>That brings me to the core philosophy of this course and how I like to approach design systems in general. This is it: there is too much to do. You won't get it all right the first time. Perfection is your greatest enemy.</p>\n<p>So, we'll focus on figuring out where our time is best spent. How we judge that is based on what's the best good we can provide our teams who want to use our design system and what are we capable of doing long term. Design systems are never really done, so we need to find the way to best pace our work.</p>\n<p>So looking at the course page, you'll see we have a few courses and inside each of them they have a few lessons.  You can see here how much it’s going to take to get through a lesson.  Right now I’m recording the  fundamentals of design system engineering</p>\n","title":"Let's get started","slug":"introduction","duration":"PT3M13S","summary":"<p>Welcome to Design Systems Engineer. In this introduction video we're going to take a look at the site, and what you can expect to find in the course. I mention in the video that if you have any questions, that you can reach out to me on twitter at <a href=\"https://twitter.com/garthdb\">@GarthDB</a>.</p>","embed":"<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/S1gZl6857xM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>","courseSlug":"fundamentals-of-design-system-engineering"}