{"html":"<p>This week I was focused on my project rubric Draft</p>\n<h1>Rubric</h1>\n<table>\n<thead>\n<tr>\n<th>Functionality - 50 points</th>\n<th>FIELD2</th>\n<th>FIELD3</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Needs Work</td>\n<td>Competent</td>\n<td>Excellent</td>\n</tr>\n<tr>\n<td>The content seems incomplete.  The navigation is not usable.  Styling is incomplete.</td>\n<td>The content is complete, organized, and useful. The navigation is intuitive and easily discoverable.</td>\n<td>The website looks professionally designed and developed. The content is semantically organized. The design itself is an example of the power and practical application of a design system.</td>\n</tr>\n<tr>\n<td>Visual Design - 100 points</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Needs Work</td>\n<td>Competent</td>\n<td>Excellent</td>\n</tr>\n<tr>\n<td>Fonts and colors are not the browser default.</td>\n<td>The website uses colors that work well together. Typography choices are optimized for readability. The page layout is intuitive.</td>\n<td>The site design would feel at home on Dribbble or Awwwards.</td>\n</tr>\n<tr>\n<td>Interacion Design - 50 points</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Needs Work</td>\n<td>Competent</td>\n<td>Excellent</td>\n</tr>\n<tr>\n<td>The site has navigation.</td>\n<td>Intentional, organized pages and navigation. Interactive elements add value and direct the students to the content they are seeking.</td>\n<td>Interactive elements add delight to the student’s experience.</td>\n</tr>\n<tr>\n<td>Course Content - 200 points</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Needs Work</td>\n<td>Competent</td>\n<td>Excellent</td>\n</tr>\n<tr>\n<td>The site exists and has some content.</td>\n<td>The content is synthesized in a way that the students learn something new. They start to see the value of design systems.</td>\n<td>The site and content are valuable resources that the students recommend to team members. The students return regularly for new content and to use it as a refresher resource.</td>\n</tr>\n<tr>\n<td>Video Content - 150 points</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Needs Work</td>\n<td>Competent</td>\n<td>Excellent</td>\n</tr>\n<tr>\n<td>The videos exist and cover the material.</td>\n<td>The videos are succinct. The audio is of high quality. The dialog is scripted and flows.</td>\n<td>The video and audio are of professional quality and feel like they were recorded in a studio.</td>\n</tr>\n</tbody>\n</table>\n","title":"Rubric draft","slug":"rubric-draft","summary":"Rubric Draft","date":"2020-10-16T00:00:00.000Z"}