{"html":"<p>I've setup all my milestones as GitHub milestones on the main project repository.</p>\n<p>I then used GanttLab to generate gantt charts for my <a href=\"/capstone-proposal.pdf\">proposal</a>. I still had to do some manual work to bring them into InDesign for the proposal, but it made the whole process a bit more efficient. Also, I tend to use GitHub issues for project management already, so it fit into my workflow well.</p>\n<h2>Pre Capstone Milestone</h2>\n<p>I put together a milestone of tasks to complete before the capstone course started and named it <a href=\"https://github.com/DesignSystemsEngineer/designsystemsengineer.github.io/milestone/2?closed=1\">Pre Capstone Milestone</a>.</p>\n<p>The tasks are:</p>\n<ol>\n<li>\n<p>Create Logo</p>\n<p>I've iterated over a few branding ideas and have at least a placeholder to start work. Here is <a href=\"logo-ideas.pdf\">a pdf</a> of some of my initial ideas. I like the metaphor of a beehive working together for explaining the design system engineering process. It isn't a perfect metaphor, but I'll keep playing with it.</p>\n</li>\n<li>\n<p>Create gh-pages</p>\n<p>I am deploying this site with the blog using GitHub Pages for hosting. The branch and code can be found <a href=\"https://github.com/DesignSystemsEngineer/designsystemsengineer.github.io/tree/gh-pages\">here</a>.</p>\n</li>\n<li>\n<p>Create newsletter with ConvertKit</p>\n<p>I've setup my ConvertKit account and prepped it for the newsletter.</p>\n</li>\n<li>\n<p>Newsletter Signup Form</p>\n<p>I setup my newsletter signup form, but there's an issue with my billing I need to fix before I can add it to the site. I already have a ticket in to their support, but may need to switch services if they can't address the issue quickly enough.</p>\n</li>\n<li>\n<p>Priminary Svelte setup</p>\n<p>This website is using Svelte and Sapper for the initial setup and blog. All the code is on the public <a href=\"https://github.com/DesignSystemsEngineer/designsystemsengineer.github.io/\">GitHub repo</a>.</p>\n</li>\n<li>\n<p>Write newsletter topics</p>\n<p>I'm aware that my topics are likely to change as I start writing the newsletter, so the most important thing I wanted to complete with this task was a list of seed topics.</p>\n<ul>\n<li>Design tokens\n<ul>\n<li>More than name value pairs</li>\n<li>Style Dictionary</li>\n<li>CC Libraries</li>\n<li>Google spreadsheet</li>\n<li>Datastore</li>\n<li>GraphQL interface</li>\n</ul>\n</li>\n<li>How to name a component</li>\n<li>What is a design system?</li>\n<li>Growing a design system</li>\n<li>Scaling a design system</li>\n<li>Design/Engineer collaboration</li>\n<li>Themes</li>\n<li>Scales</li>\n<li>Platforms</li>\n<li>Variants</li>\n<li>States</li>\n</ul>\n</li>\n<li>\n<p>Schedule Live Webinar</p>\n<p>I did not complete this task in time. I'm rethinking the webinars and how to best use them. I'll need to finish working out what I want to do before I can really plan it out.</p>\n</li>\n</ol>\n","title":"What I did over summer vacation","slug":"summer-2020","summary":null,"date":"2020-09-01T00:00:00.000Z"}